In [373]:
import numpy as np
import pandas as pd
import seaborn as sb
import matplotlib.pyplot as plt
%matplotlib inline

In [374]:
data= sb.load_dataset('titanic')
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [375]:
data.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [376]:
data['age']=data['age'].fillna(data['age'].median())

In [377]:
data.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [378]:
data=data.drop(columns=['embarked'])

In [379]:
data['deck']=data['deck'].astype('string')
data['deck']=data['deck'].fillna("Miss")
data['deck']=data['deck'].astype("category")

In [380]:
data['deck']=data['deck'].astype('string').str[0]

In [381]:
data.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [382]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,Third,man,True,M,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,Third,woman,False,M,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,Third,man,True,M,Southampton,no,True

In [383]:
sex={
    'male':0,
    'female':1
}
data['sex']=data['sex'].map(sex)

In [384]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,0,22.0,1,0,7.2500,Third,man,True,M,Southampton,no,False
1,1,1,1,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,yes,False
2,1,3,1,26.0,0,0,7.9250,Third,woman,False,M,Southampton,yes,True
3,1,1,1,35.0,1,0,53.1000,First,woman,False,C,Southampton,yes,False
4,0,3,0,35.0,0,0,8.0500,Third,man,True,M,Southampton,no,True

In [385]:
data=data.drop(columns=['parch','fare','class','who','adult_male','embark_town','alive'])

In [386]:
data.isnull().sum()
data.head()

   survived  pclass  sex   age  sibsp deck  alone
0         0       3    0  22.0      1    M  False
1         1       1    1  38.0      1    C  False
2         1       3    1  26.0      0    M   True
3         1       1    1  35.0      1    C  False
4         0       3    0  35.0      0    M   True

In [387]:
data.isnull().sum()

survived    0
pclass      0
sex         0
age         0
sibsp       0
deck        0
alone       0
dtype: int64

In [388]:
alone={
    False:0,
    True:1
}
data['alone']=data['alone'].map(alone)

In [389]:
data.head()

   survived  pclass  sex   age  sibsp deck  alone
0         0       3    0  22.0      1    M      0
1         1       1    1  38.0      1    C      0
2         1       3    1  26.0      0    M      1
3         1       1    1  35.0      1    C      0
4         0       3    0  35.0      0    M      1

In [390]:
data.head()

   survived  pclass  sex   age  sibsp deck  alone
0         0       3    0  22.0      1    M      0
1         1       1    1  38.0      1    C      0
2         1       3    1  26.0      0    M      1
3         1       1    1  35.0      1    C      0
4         0       3    0  35.0      0    M      1

In [391]:
mean=data.groupby('deck')['survived'].mean().to_dict()
data['deck']=data['deck'].map(mean)

In [392]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler

In [393]:
sc=MinMaxScaler()

In [394]:
X=data.iloc[:,1:6].values
y=data.iloc[:,0].values

In [395]:
X,y

(array([[ 3.        ,  0.        , 22.        ,  1.        ,  0.2994186 ],
        [ 1.        ,  1.        , 38.        ,  1.        ,  0.59322034],
        [ 3.        ,  1.        , 26.        ,  0.        ,  0.2994186 ],
        ...,
        [ 3.        ,  1.        , 28.        ,  1.        ,  0.2994186 ],
        [ 1.        ,  0.        , 26.        ,  0.        ,  0.59322034],
        [ 3.        ,  0.        , 32.        ,  0.        ,  0.2994186 ]]),
 array([0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1,
        1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
        1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1,
        1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0,
        1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0,
        0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
        0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0,
        1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0,
        1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1,
        0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0,
        0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
        1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1,
        0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1,
        1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0,
        0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0,
        0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0,
        0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0,
        1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0,
        0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
        1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0,
        1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0,
        0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1,
        1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
        1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0,
        0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1,
        0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0,
        0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
        1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1,
        0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0,
        0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0,
        1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1,
        0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0,
        0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
        0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1,
        0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1,
        1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1,
        1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0], dtype=int64))

In [396]:
X

array([[ 3.        ,  0.        , 22.        ,  1.        ,  0.2994186 ],
       [ 1.        ,  1.        , 38.        ,  1.        ,  0.59322034],
       [ 3.        ,  1.        , 26.        ,  0.        ,  0.2994186 ],
       ...,
       [ 3.        ,  1.        , 28.        ,  1.        ,  0.2994186 ],
       [ 1.        ,  0.        , 26.        ,  0.        ,  0.59322034],
       [ 3.        ,  0.        , 32.        ,  0.        ,  0.2994186 ]])

In [397]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.25,random_state=0)
sc1= MinMaxScaler()
X_train= sc1.fit_transform(X_train)
X_test = sc1.transform(X_test)

In [398]:
from sklearn.tree import DecisionTreeClassifier
classifier= DecisionTreeClassifier()
classifier= classifier.fit(X_train,y_train)

In [399]:
y_pred = classifier.predict(X_test)

In [400]:
from sklearn.metrics import confusion_matrix

In [401]:
confusion_matrix(y_test,y_pred)

array([[112,  27],
       [ 28,  56]], dtype=int64)

In [405]:
from sklearn.metrics import accuracy_score

In [406]:
accuracy_score(y_test,y_pred)

0.7533632286995515

In [408]:
from sklearn.ensemble import RandomForestClassifier

In [409]:
dt=RandomForestClassifier()

In [412]:
dt=dt.fit(X_train,y_train)

y_pre=dt.predict(X_test)

In [414]:
confusion_matrix(y_test,y_pre)

array([[115,  24],
       [ 25,  59]], dtype=int64)

In [415]:
accuracy_score(y_test,y_pre)

0.7802690582959642

In [418]:
from sklearn.linear_model import LogisticRegression

In [419]:
lmodel=LogisticRegression()

In [420]:
lmodel=lmodel.fit(X_train,y_train)

In [421]:
y_pr=lmodel.predict(X_test)

In [422]:
confusion_matrix(y_pr,y_test)

array([[113,  22],
       [ 26,  62]], dtype=int64)

In [423]:
accuracy_score(y_pr,y_test)

0.7847533632286996